---
type: ClassificationEntries
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# ClassificationEntries

`Autodesk.Revit.DB.ClassificationEntries` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | LoadClassificationEntriesFromFile | 2015 | `public static bool LoadClassificationEntriesFromFile ( string filePath , KeyBasedTreeEntriesLoadContent loadContent )` |